

// 3***. Задание на HTML, CSS, JS (Ajax) и NodeJS: Разработать сервер,

// который умеет отдавать запрашиваемые html страницы и JSON данные.

// Дана страница с товарами product.html. Дан файл products.json в

// котором есть 8 товаров. По загрузке страницы product.html страница

// запрашивает первые четыре товара с сервера из файла products.json,

// и отстраивает краткие карточки четырёх товаров. Внизу страницы

// product.html расположена кнопка «Показать ещё товары» по нажатию

// на которые догружается оставшиеся 4 товара из файла products.json

// и отстраиваются их карточки.